#+TITLE: Material Selection
#+SUBTITLE: ME 310: Mechanical Design
#+AUTHOR: Sappinandana Akamphon

#+OPTIONS: toc:nil timestamp:nil H:2 title:nil
#+OPTIONS: reveal_width:1280 reveal_height:1024
#+OPTIONS: reveal_single_file:t
#+REVEAL_THEME: sky
#+REVEAL_TRANS: slide
#+REVEAL_EXTRA_CSS: bearings.css

#+STARTUP: beamer
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [10pt, svgnames]
#+BEAMER_THEME: metropolis
#+LATEX_COMPILER: xelatex
#+BEAMER_HEADER: \usepackage{booktabs}
#+BEAMER_HEADER: \usepackage{pgfplots}
#+BEAMER_HEADER: \pgfplotsset{compat=1.18}
#+BEAMER_HEADER: \institute{Department of Mechanical Engineering, TSE}
#+BEAMER_HEADER: \date{}
#+BEAMER_HEADER: \usetikzlibrary{patterns,shapes,arrows}
#+BEAMER_HEADER: \AtBeginSection[]{\begin{frame}{Outline}\tableofcontents[currentsection]\end{frame}}
#+BEAMER_HEADER: \definecolor{lightblue}{RGB}{180,220,255}

\frame{\titlepage}

** The Hard Way
  Let's assume $N_s = 2$. The cross-sectional area required for each material is

  \begin{gather*}
    N_s = \frac{S_y}{\dfrac{F}{A}} \\
    A = \frac{N_S F}{S_y}
  \end{gather*}

#+BEGIN_SRC python :results output raw :exports results
d_st = 7800
d_al = 2300
d_cf = 1500
y_st = 1200*10**6
y_al = 400*10**6
y_cf = 350*10**6

N_s = 2
F = 50000

A_st = N_s * F / y_st
A_al = N_s * F / y_al
A_cf = N_s * F / y_cf

print(r'\begin{center}')
print(r'\begin{tabular}{lc}')
print(r'\toprule')
print(r'HSS & %.2e m$^2$ \\' % (A_st))
print(r'Aluminum & %.2e m$^2$ \\' % (A_al))
print(r'CFRP & %.2e m$^2$ \\' % (A_cf))
print(r'\bottomrule')
print(r'\end{tabular}')
print(r'\end{center}')
#+END_SRC

#+RESULTS:
\begin{center}
\begin{tabular}{lc}
\toprule
HSS & 8.33e-05 m$^2$ \\
Aluminum & 2.50e-04 m$^2$ \\
CFRP & 2.86e-04 m$^2$ \\
\bottomrule
\end{tabular}
\end{center}


** Comparing mass
  Once cross-sectional areas are obtained, mass is just

  \begin{equation*}
    m = \rho A l
  \end{equation*}

#+BEGIN_SRC python :results output raw :exports results
d_st = 7800
d_al = 2300
d_cf = 1500
y_st = 1200*10**6
y_al = 400*10**6
y_cf = 350*10**6

N_s = 2
F = 50000

A_st = N_s * F / y_st
A_al = N_s * F / y_al
A_cf = N_s * F / y_cf

m_st = d_st * A_st
m_al = d_al * A_al
m_cf = d_cf * A_cf

print(r'\begin{center}')
print(r'\begin{tabular}{lc}')
print(r'\toprule')
print(r'Material & Mass (kg) \\')
print(r'\midrule')
print(r'HSS & %.2e $l$ \\' % (m_st))
print(r'Aluminum & %.2e $l$ \\' % (m_al))
print(r'CFRP & %.2e $l$ \\' % (m_cf))
print(r'\bottomrule')
print(r'\end{tabular}')
print(r'\end{center}')
#+END_SRC

#+RESULTS:
\begin{tabular}{lc}
\toprule
Material & Mass (kg) \\
\midrule
HSS & 6.50e-01 $l$ \\
Aluminum & 5.75e-01 $l$ \\
CFRP & 4.29e-01 $l$ \\
\bottomrule
\end{tabular}

  So CFRP is the lightest, regardless of length $l$.


